# LiveLab: Creating a Simple Dash App 


## Dataset Description:

You are working with a college sports dataset from [Kaggle](https://www.kaggle.com/datasets/umerhaddii/us-collegiate-sports-dataset)

### Step 1:  Load & Inspect Data

In [3]:
#Import pandas, plotly, and dash packages 
#import dash
#from dash import html, dcc
#from dash.dependencies import Input, Output
import pandas as pd
import plotly.express as px

In [5]:
# Read in the data 

df = pd.read_csv("../data/sports.csv")

/var/folders/h0/75t8pd8571n2l1zzjcyqp7kh0000gp/T/ipykernel_56893/2988330143.py:3: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("../data/sports.csv")

### Step 2:  Clean the Data and Only keep the Revenue Columns

In [6]:
# Drop the NAs on the revenue columns 

df.head()
#df_clean = df.dropna()

,year,unitid,institution_name,city_txt,state_cd,zip_text,classification_code,classification_name,classification_other,ef_male_count,...,partic_coed_women,sum_partic_men,sum_partic_women,rev_men,rev_women,total_rev_menwomen,exp_men,exp_women,total_exp_menwomen,sports
0,2015,100654,Alabama A & M University,Normal,AL,35762.0,2,NCAA Division I-FCS,NaN,1923,...,NaN,31,0,345592.0,NaN,345592.0,397818.0,NaN,397818.0,Baseball
1,2015,100654,Alabama A & M University,Normal,AL,35762.0,2,NCAA Division I-FCS,NaN,1923,...,NaN,19,16,1211095.0,748833.0,1959928.0,817868.0,742460.0,1560328.0,Basketball
2,2015,100654,Alabama A & M University,Normal,AL,35762.0,2,NCAA Division I-FCS,NaN,1923,...,NaN,61,46,183333.0,315574.0,498907.0,246949.0,251184.0,498133.0,All Track Combined
3,2015,100654,Alabama A & M University,Normal,AL,35762.0,2,NCAA Division I-FCS,NaN,1923,...,NaN,99,0,2808949.0,NaN,2808949.0,3059353.0,NaN,3059353.0,Football
4,2015,100654,Alabama A & M University,Normal,AL,35762.0,2,NCAA Division I-FCS,NaN,1923,...,NaN,9,0,78270.0,NaN,78270.0,83913.0,NaN,83913.0,Golf

### Step 3:  Compute Averages and Put in a New DataFrame

In [ ]:
# Compute averages
avg_men = None
avg_women = None

# Put in a new DataFrame for plotting
df_plot = pd.DataFrame({
    "Gender": ["Men", "Women"],
    "Average Revenue": [avg_men, avg_women]
})

### Step 4:  Plot the Data

In [ ]:
# Plot grouped bar chart of Gender and Average Revenue 
fig = px.bar(df_plot, x=None, y=None, title="Average Sports Revenue by Gender")
fig.show()

### Step 4 Build the Dash App

In [ ]:
app = dash.Dash(__name__)
app.title = None

app.layout = html.Div([
    html.H1(None style={'textAlign': 'center'}),
    dcc.Graph(figure=None)
])

if __name__ == "__main__":
    app.run(debug=True)

### Step 5:  View in Browser

Open up a browser to see if it pops up:  http://localhost:8050/